BEGIN TRAN;

DECLARE @NewPrices TABLE (
    itid INT,
    itprice DECIMAL(10,2)
);

INSERT INTO @NewPrices (itprice, itid)
VALUES
(13,1),
(13,2),
(12,3),
(10,4),
(7,5),
(12,6),
(14,7),
(14,8),
(10,9),
(14,10),
(9,13),
(14,14),
(12,15),
(14,26),
(14,27),
(14,28),
(13,29),
(12,30),
(14,33),
(14,34),
(16,35),
(8,53),
(16,54),
(15,55),
(5,76),
(5,77),
(6,78),
(5,79),
(2,80),
(18,81),
(15,82),
(6,83),
(6,84),
(5,85),
(9,87),
(18,88),
(7,89),
(14,90),
(20,101),
(20,102),
(7,104),
(4,108),
(2,109),
(10,110),
(12,126),
(12,127),
(10,128),
(12,129),
(12,130),
(14,135),
(15,151),
(4,152);

UPDATE pr
SET pr.itprice = np.itprice
FROM prices_items pr
INNER JOIN @NewPrices np
    ON pr.itid = np.itid;

-- راجع عدد الصفوف اللي اتحدثت
SELECT @@ROWCOUNT AS UpdatedRows;

-- لو كل شيء تمام
COMMIT;

-- لو حصل أي خطأ
-- ROLLBACK;